{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 5, "b_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "W_regularizer": null, "input_dtype": "float32", "activity_regularizer": null, "subsample": [1, 1], "batch_input_shape": [null, 160, 320, 3], "name": "convolution2d_1", "b_constraint": null, "nb_filter": 24, "bias": true, "activation": "linear", "W_constraint": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "th", "name": "maxpooling2d_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "b_regularizer": null, "nb_row": 5, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_2", "b_constraint": null, "nb_filter": 36, "bias": true, "activation": "linear", "W_constraint": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "b_regularizer": null, "nb_row": 5, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_3", "b_constraint": null, "nb_filter": 48, "bias": true, "activation": "linear", "W_constraint": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_3"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_4", "b_constraint": null, "nb_filter": 64, "bias": true, "activation": "linear", "W_constraint": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_4"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_5", "b_constraint": null, "nb_filter": 64, "bias": true, "activation": "linear", "W_constraint": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_5"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": 3136, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 100, "b_constraint": null, "bias": true, "activation": "linear", "W_constraint": null, "trainable": true, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": 100, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 50, "b_constraint": null, "bias": true, "activation": "linear", "W_constraint": null, "trainable": true, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": 50, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 10, "b_constraint": null, "bias": true, "activation": "linear", "W_constraint": null, "trainable": true, "name": "dense_3"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": 10, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 1, "b_constraint": null, "bias": true, "activation": "linear", "W_constraint": null, "trainable": true, "name": "dense_4"}}], "keras_version": "1.2.0"}